Revit 2026 API

# GroundConductorSizeSetForwardIterator Method

---

Retrieve a forward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual GroundConductorSizeSetIterator ForwardIterator()
```
```vb
Public Overridable Function ForwardIterator As GroundConductorSizeSetIterator
```
```cpp
public:
virtual GroundConductorSizeSetIterator^ ForwardIterator()
```
```fsharp
abstract ForwardIterator : unit -> GroundConductorSizeSetIterator
override ForwardIterator : unit -> GroundConductorSizeSetIterator
```

#### Return Value

GroundConductorSizeSetIteratorReturns a forward moving iterator to the set.

#### Reference

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace